Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: perl -le '$a = "NaN"; print "NaN support here" if $a != $a'
es_es: perl -le '$a = "NaN"; print "tiene soporte NaN" if $a != $a'

source: DELETE this, key
es_es: DELETE este, clave

source: The other escape sequences such as C<\200> and C<\t> and backslashed characters such as C<\\> and C<\-> are converted to appropriate literals.
es_es: Las otras secuencias de escape, como C<\200> y C<\t> y caracteres escapados con contrabarras, como C<\\> y C<\->, son convertidas a literales apropiados.

source: This pattern matches nothing and always fails.
es_es: Este patrón no coincide con nada y fallará siempre.

source: If necessary run just the failing scripts again sequentially and see if the failures go away.
es_es: Si es necesario ejecute los scripts una vez más de forma secuencial y mire a ver si los errores desaparecen.

source: The oct() function is commonly used when a string such as C<644> needs to be converted into a file mode, for example.
es_es: La función oct() es de uso común cuando una cadena como C<644> tiene que ser convertida en un modo de archivo, por ejemplo.

source: Instead it is primarily used to check if two pieces of text are the same without having to transmit or store the text itself.
es_es: En cambio se usa principalmente para comprobar si dos trozos de textos son el mismo sin tener que transmitirlo o almacenarlo.

source: Not doing so may lead to surprises:
es_es: El no hacerlo puede dar lugar a sorpresas:

source: In the peculiar C<use VERSION> form, VERSION may be either a positive decimal fraction such as 5.006, which will be compared to C<$]>, or a v-string of the form v5.6.1, which will be compared to C<$^V> (aka $PERL_VERSION).
es_es: En la forma peculiar C<use VERSION>, VERSION puede ser tanto un número fraccionario decimal positivo, como 5.006, que será comparado con C<$]>, o como una v-cadena de la forma v5.6.1, que será comparado con C<$^V> (también conocido como $PERL_VERSION).

source: Despite the funny names, precedence is the same as any other named unary operator.
es_es: A pesar de los nombres graciosos, la precedencia es la misma que cualquier otro operador unario con nombre.

source: =head3 Fall-through
es_es: =head3 Atravesar

source: http://www.pm.org/ the Perl Mongers
es_es: http://www.pm.org/ el sitio de Perl Mongers

source: If you were into Schwartzian Transforms, you would probably have selected map for that
es_es: Si está en una transformada Schwartziana, es probable que haya elegido map para esto

source: Do not worry, you've apparently got the ASCII->EBCDIC translation worked out correctly.
es_es: No se preocupe, parecer que le funcionó correctamente la traducción EBCDIC->ASCII.

source: Any undef undefined !defined $a
es_es: Cualquiera undef indefinido !defined $a

source: die q(I don't know what to do with $foo);
es_es: die q(No sé qué hacer con $foo);

source: =item C<RE> in C<?RE?>, C</RE/>, C<m/RE/>, C<s/RE/foo/>,
es_es: =item C<RE> en C<?RE?>, C</RE/>, C<m/RE/>, C<s/RE/foo/>,

source: X<defined> X<undefined> X<undef> X<null> X<string, null>
es_es: X<defined> X<definido> X<undefined> X<indefinido> X<undef> X<null> X<nulo> X<string, null> X<cadena, nulo>

source: C<charnames> upgraded to version 1.05
es_es: C<charnames> actualizado a la versión 1.05

source: one
es_es: único

source: \z Match only at end of string
es_es: \z Coincide solo con el final de la cadena

source: undef Hash always false (undef can't be a key)
es_es: undef Hash siempre falso (undef no puede ser una clave)

source: You should seldom if ever use C<0644> as argument to C<sysopen>, because that takes away the user's option to have a more permissive umask.
es_es: Rara vez o nunca debe utilizar C<0644> como argumento a C<sysopen>, porque eso le quita al usuario la opción de tener un umask más permisivo.

source: The Perl 5 smart match and C<given>/C<when> constructs are not absolutely identical to their Perl 6 analogues.
es_es: La coincidencia inteligente de Perl 5 y las construcciones C<given>/C<when> no son completamente idénticas a sus análogas en Perl 6.

source: At other times, a simple comparison to C<0> or C<""> is what you want.
es_es: En otras ocasiones, una simple comparación con C<0> o C<""> es lo que necesita.

source: Typically these are arguments such as might be passed to the C<dbm_open()> function of C. The object returned by the C<new> method is also returned by the C<tie> function, which would be useful if you want to access other methods in CLASSNAME.
es_es: Por lo general estos son argumentos que pudieran ser transmitidos a la función del C C<dbm_open()>. El objeto devuelto por el método C<new> también es devuelto por la función C<tie>, que será útil si desea tener acceso a otros métodos en CLASE.

source: =item gethostbyname NAME
es_es: =item gethostbyname NOMBRE

source: This has two effects: first, a C<write> or a C<print> without a filehandle default to this FILEHANDLE.
es_es: Esto tiene dos efectos: primero, un C<write> o un C<print> sin un identificador de archivo será por defecto este IDENTIFICADOR_ARCHIVO.

source: perlmodinstall Perl modules: how to install from CPAN
es_es: perlmodinstall Instalación de módulos de CPAN

source: Anything else is unsafe.
es_es: Cualquier otro caso no es seguro.

source: The right operand is not evaluated while the operator is in the "false" state, and the left operand is not evaluated while the operator is in the "true" state.
es_es: El operando de la derecha no es evaluado, mientras que el operador esté en el estado "falso", y el operando de la izquierda no es evaluado mientras que el operador se encuentre en el estado "verdadero".

source: perl5137delta Perl changes in version 5.13.7
es_es: perl5137delta Cambios en la versión 5.13.7

source: $^ = 'report1_top';
es_es: $^ = 'informe1_top';

source: Assigning to C<$#days> actually changes the length of the array.
es_es: Asignar un valor a C<$#días> cambia realmente la longitud del array.

source: But never write "PERL", because perl is not an acronym, apocryphal folklore and post-facto expansions notwithstanding.
es_es: Pero nunca escriba "PERL", ya que perl no es un acrónimo (pese al folclore apócrifo y los desarrollos inventados posteriormente).

source: =item index STR,SUBSTR,POSITION X<index> X<indexOf> X<InStr>
es_es: =item index STRING,SUBSTR,POSICIÓN X<index> X<indexOf> X<InStr>

# print "3: got $1 " if $x =~ /^(D*)(?!123)/;
source: print "3: got $1\n" if $x =~ /^(\D*)(?!123)/;
es_es: print "3: tenemos $1\n" if $x =~ /^(\D*)(?!123)/;

source: These are documented at great length in L<perlre>, but for the meantime, here's a quick cheat sheet:
es_es: Estas se describen de forma detallada en L<perlre>. A continuación se incluye una guía rápida:

source: The caching of conversions (as described above) means that the integer conversion does not throw away fractional parts on floating point numbers.
es_es: El almacenamiento en caché de las conversiones descritas arriba significa que la conversión a enteros no desecha las partes fraccionarias en los números de punto flotante.

source: C<\Q>, C<\U>, C<\u>, C<\L>, C<\l> (possibly paired with C<\E>) are converted to corresponding Perl constructs.
es_es: C<\Q>, C<\U>, C<\u>, C<\L>, C<\l> (posiblemente emparejado con C<\E>) son convertidas a las correspondientes construcciones Perl.

source: (whichever was last seen)
es_es: (lo que se haya visto por última vez)

source: The smart match operator C<~~> is no longer commutative.
es_es: El operador de coincidencia inteligente C<~~> ya no es conmutativo.

source: Use the new C<and> and C<or> operators to avoid having to parenthesize list operators so much, and to reduce the incidence of punctuation operators like C<&&> and C<||>.
es_es: Use los nuevos operadores C<and> y C<or> para evitar poner demasiados paréntesis en listas de operadores y para reducir la incidencia de puntuación de operadores como C<&&> y C<||>.

source: You are I<strongly> advised to follow this introduction with more information from the full Perl manual, the table of contents to which can be found in L<perltoc>.
es_es: Es I<muy> recomendable complementar esta introducción con información del manual de Perl completo, cuya tabla de contenido se encuentra en L<perltoc>.

source: ISBN 0-596-10206-2 [1st edition March 2006]
es_es: ISBN 0-596-10206-2 [1ª edición - Marzo de 2006]

source: The joke is that it's scheduled for Christmas, but that we just don't know which one.
es_es: Decimos en broma que saldrá en Navidad, pero no confirmamos el año de lanzamiento.

source: See L</binmode>, L</open>, and the C<open> pragma, L<open>.
es_es: Ver L</binmode>, L</open>, y el pragma C<open>, L<open>.

source: The only universally recognized values for EXPR are C<0> for success and C<1> for error; other values are subject to interpretation depending on the environment in which the Perl program is running.
es_es: Los únicos valores universalmente reconocidos para EXPR son C<0> para éxito y C<1> para error; otros valores están sujetos a interpretación dependiendo del entorno en que el programa Perl está corriendo.

source: use v5.14; # needed for implicit deref of array refs by array ops
es_es: use v5.14; # necesario para una desref. implícita de ref. de array para oper. de array

source: =item when EXPR BLOCK X<when>
es_es: =item when EXPR BLOQUE X<when>

source: Decoding can't happen reliably if you don't know how the data was encoded.
es_es: No es posible descodificar de manera fiable si no se sabe cómo se codificaron los datos.

source: No further attempts to find a valid match by advancing the start pointer will occur again.
es_es: No habrá nuevos intentos para encontrar una coincidencia válida avanzando el puntero de arranque.

source: [\000-\177]; # wickedly delete 8th bit
es_es: [\000-\177]; # borra onerosamente el octavo bit

source: < sSiIlLqQ Force little-endian byte-order on the type.
es_es: < sSiIlLqQ Fuerza un orden de bytes en little-endian.

source: In scalar context, C<stat> returns a boolean value indicating success or failure, and, if successful, sets the information associated with the special filehandle C<_>.
es_es: En contexto escalar, C<stat> devuelve un valor booleano que indica el éxito o el fracaso y, si tiene éxito, establece la información asociada con el identificador de archivo especial C<_>.

source: Returns true for success, false otherwise.
es_es: Devuelve verdadero en caso de éxito, o falso en caso contrario.

source: See also C<not> for a lower precedence version of this.
es_es: Vea también C<not> para una versión de menor prioridad que ésta.

source: =head2 Change to "Can't locate Foo.pm in @INC" error
es_es: =head2 Cambiado el error "Can't locate Foo.pm in @INC"

source: =head3 Text strings (character strings)
es_es: =head3 Cadenas de texto (cadenas de caracteres)

source: (A semicolon is still encouraged if the block takes up more than one line, because you may eventually add another line.) Note that there are some operators like C<eval {}> and C<do {}> that look like compound statements, but aren't (they're just TERMs in an expression), and thus need an explicit termination if used as the last item in a statement.
es_es: (Un punto y coma es aún así recomendable si el bloque tiene más de una línea, porque, eventualmente, puede añadir alguna línea más). Note que algunos operadores como C<eval {}> y C<do {}> parecen instrucciones compuestas, pero no lo son (son sólo TÉRMINOS en una expresión) y es necesario una terminación explícita si se usa como el último punto de una instrucción.

source: If the filehandle came from a piped open, C<close> returns false if one of the other syscalls involved fails or if its program exits with non-zero status.
es_es: Si el identificador de archivo proviene de una tubería abierta, C<close> adicionalmente devolverá falso si alguna de las otras llamadas del sistema implicadas falla, o si el programa termina con un valor de estado distinto de cero.

source: It's also a simple rule that works consistently with C<VAR_NAMES_LIKE_THIS>.
es_es: Es una regla que funciona también con C<VAR_NOMBRES_COMO_ESTE>.

source: =head2 Deprecation Warnings
es_es: =head2 Advertencias de desaprobación

source: do not form legal quoted expressions.
es_es: no forman expresiones legales de entrecomillado.

source: # produces 123456789123456784
es_es: # produce 123456789123456784

source: For example, the third line above produces:
es_es: Por ejemplo, la tercera línea de arriba produce:

source: One way to describe which substring is actually matched is the concept of backtracking (see L<"Backtracking">).
es_es: Una forma de describir qué subcadena coincidente realmente, es con el concepto de dar marcha atrás (vea L<"Marcha atrás">).

source: 2 mode file mode (type and permissions)
es_es: 2 mode modo de archivo (tipo y permisos)

source: instead of
es_es: en lugar de

source: On systems that don't support fchown(2), passing filehandles raises an exception.
es_es: En sistemas que no admiten fchown(2), pasarle un identificador de archivo lanza una excepción.

source: Include tests with your module
es_es: Incluya test con su módulo

source: =item truncate FILEHANDLE,LENGTH X<truncate>
es_es: =item truncate IDENTIFICADOR_ARCHIVO,LONGITUD X<truncate>

source: So instead of
es_es: Así que en lugar de

source: Only available after Perl 5.10, and only if the C<switch> feature has been requested.
es_es: Sólo está disponible después de Perl 5.10, y sólo si la característica C<switch> ha sido solicitada.

source: Irrespective of its distribution, all code examples here are in the public domain.
es_es: Independientemente de su distribución, todos los ejemplos de código incluidos son de dominio público.

source: Your module should also include a README file describing the module and giving pointers to further information (website, author email).
es_es: El módulo también debe incluir un archivo README que describa el módulo y dé consejos para obtener más información (página web, correo electrónico del autor).

source: This document differs from L<perlnewmod> in that it is a style guide rather than a tutorial on creating CPAN modules.
es_es: Este documento se diferencia de L<perlnewmod> en que se trata de una guía de estilo en lugar de un manual sobre la creación de módulos de CPAN.

source: $path =~ s|/usr/bin|/usr/local/bin|;
es_es: $ruta =~ s|/usr/bin|/usr/local/bin|;

source: Only one timer may be counting at once.
es_es: Sólo un temporizador puede estar contando cada vez.

source: The function should return a reference to an array containing the parent classes in order.
es_es: La función debe devolver una referencia a una array que contiene las clases padres en orden.

source: This has now been fixed.
es_es: Este error ya se ha solucionado.

source: Stay tuned, but don't worry that you'll have to change major versions of Perl; no one is going to take Perl 5 away from you.
es_es: Puede seguir su desarrollo, pero no debe preocuparse por tener que actualizar Perl; nadie va a quitarle Perl 5.

source: HASH is the name of the hash.
es_es: HASH es el nombre del hash.

source: my $nodelay = unpack("I", $packed);
es_es: my $nodelay = unpack("I", $empaquetado);

source: Considerations for module design and coding:
es_es: Consideraciones para el diseño y codificación del módulo:

source: =item * F<Maintainers>, F<Maintainers.pl>, and F<Maintainers.pm>
es_es: =item * F<Maintainers>, F<Maintainers.pl> y F<Maintainers.pm>

source: You might even try the "I feel lucky" button.
es_es: Incluso puede probar el botón "Voy a tener suerte"

source: UNTIE this
es_es: UNTIE este

source: The C-generating compiler backend B::C (the frontend being C<perlcc -c>) is even more broken than it used to be because of the extensive lexical variable changes.
es_es: El soporte de compilador generador de C, B::C (la interfaz que hay por detrás de C<perlcc -c>) sigue estando aún más roto de lo que solía ser a causa de extensos cambios en las variables léxicas.

source: If you are intending to manipulate bitstrings, be certain that you're supplying bitstrings: If an operand is a number, that will imply a B<numeric> bitwise operation.
es_es: Si tiene la intención de manipular cadenas de bits, asegúrese de que está suministrando cadenas de bits: si un operando es un número, esto implicará una operación binaria B<numérica> bit a bit.

source: This allows the constructs such as C<open(my $fh, ...)> and C<open(local $fh,...)> to be used to create filehandles that will conveniently be closed automatically when the scope ends, provided there are no other references to them.
es_es: Esto permite que instrucciones como C<open(my $fh, ...)> y C<open(local $fh,...)> se utilicen para crear identificadores de archivo que convenientemente se cerrarán automáticamente cuando termine el ámbito de aplicación, siempre que no haya otras referencias a ellos.

source: Internal cleanup
es_es: Limpieza interior

source: Enhanced documentation
es_es: Mejora en la documentación

source: See L<perlmodlib> for a list of standard modules and pragmas.
es_es: Ver L<perlmodlib> para una lista de módulos y pragmas estándar.

source: Note for Linux users: on Linux, the C functions C<getpid()> and C<getppid()> return different values from different threads.
es_es: Nota para usuarios Linux: en Linux, las funciones C C<getpid()> y C<getppid()> devuelven valores diferentes para hilos (threads) diferentes.

source: s {foo} # Replace foo
es_es: s {foo} # Reemplaza foo

source: =item "Copyright Holder"
es_es: =item "Titular del Copyright"

source: perlreapi Perl regular expression plugin interface
es_es: perlreapi Interfaz de complementos: expresiones regulares

source: For an example where side-effects of look-ahead I<might> have influenced the following match, see L</C<< (?>pattern) >>>.
es_es: Para ver un ejemplo de los efectos secundarios de las aserciones antecedentes que I<pueden> influir en la siguiente coincidencia, vea L</C<< (?>patrón) >>>.

source: If you're looking for the information on how to use here-documents, which used to be here, that's been moved to L<perlop/Quote and Quote-like Operators>.
es_es: Si está buscando por información de cómo usar documentos embebidos, que solía estar aquí, ha sido trasladada a L<perlop/Comillas y Operadores de comillas>.

source: You can double the braces to make them such, though.
es_es: Aunque puede doblar las llaves para crearlos.

source: See Knuth, volume II, for a more robust treatment of this topic.
es_es: Ver Knuth, volumen II, para un tratamiento más fuerte de este tema.

source: There are no changes intentionally incompatible with 5.8.7.
es_es: No hay cambios intencionadamente incompatibles con 5.8.7.

source: See L<perlvar/"$/">.
es_es: Ver L<perlvar/"$/">.

source: =item chdir FILEHANDLE
es_es: =item chdir IDENTIFICADOR_ARCHIVO

source: Tests for built-in IO functions, including command line arguments.
es_es: Pruebas de funciones de E/S predefinidas, incluidos los argumentos de línea de comandos.

source: C<prove> is part of Test::Harness, which users of earlier Perl versions can install from CPAN.
es_es: C<prove> es parte de Test::Harness, que los usuarios de versiones anteriores de Perl pueden instalar desde CPAN.

source: my @squares = map { $_ * $_ } @numbers;
es_es: my @cuadrados = map { $_ * $_ } @numeros;

source: The LFS (large file support) tests (C<t/op/lfs> and C<xt/Fcntl/t/syslfs>) are disabled as seeking beyond 2 GB is broken according to jhi@iki.fi who was the last one checking the BeOS port and updating this file before me.
es_es: Los test para LFS (I<large file support>, soporte para archivos grandes) (C<t/op/lfs> y C<xt/Fcntl/t/syslfs>) están deshabilitados, debido a que el posicionamiento a más de 2 GB falla, según jhi@iki.fi, que fue el último que controló la adaptación de BeOS y la actualización de este archivo antes de mí.

source: (In scalar context, it returns merely the first value produced.)
es_es: (En contexto escalar, devuelve sólo el primer valor producido).

source: sub backwards ($$) { $_[1] cmp $_[0]; } # $a and $b are not set here
es_es: sub al_reves ($$) { $_[1] cmp $_[0]; } # $a y $b no se usan aquí

source: Typically this is used like the normal piped open when you want to exercise more control over just how the pipe command gets executed, such as when running setuid and you don't want to have to scan shell commands for metacharacters.
es_es: Habitualmente esto se usa como el open entubado cuando quiere ejercer más control sobre cómo el comando entubado es ejecutado, como cuando se ejecuta con setuid y no quiero tener que escanear comandos del shell buscando metacaracteres.

source: Your module should run successfully under the strict pragma and should run without generating any warnings.
es_es: Su módulo debe funcionar con éxito bajo el I<pragma strict> y debe funcionar sin generar ninguna advertencia.

source: Future versions of Perl are likely to eliminate these arbitrary limitations.
es_es: Las futuras versiones de Perl probablemente eliminarán estas limitaciones arbitrarias.

source: Better yet, use the carefully constrained evaluation within a Safe compartment.
es_es: Mejor aún, utilice la evaluación cuidadosamente limitada dentro de un compartimento de seguridad.

source: Again, this does not mean that Perl can do operations only over integers in this range: it is possible to store many more integers in floating point format.
es_es: Insistimos: esto no significa que Perl sólo puede realizar operaciones con enteros de este intervalo; es posible almacenar muchos más enteros en formato de punto flotante.

# print "We use ${who}speak when ${who}'s here. ";
source: print "We use ${who}speak when ${who}'s here.\n";
es_es: print "Usamos un ${quien}_altavoz cuando $quien está aquí.\n";

source: The C<h> and C<H> formats pack a string that many nybbles (4-bit groups, representable as hexadecimal digits, C<"0".."9"> C<"a".."f">) long.
es_es: El formato C<h> y C<H> empaqueta una cadena con tantos nibles (grupos de 4 bits, representables como dígitos hexadecimales, C<"0" .. "9"> C<"a" .. "f">) contenga.

source: The following guidelines may help you judge whether your API is sufficiently straightforward:
es_es: Las siguientes pautas pueden ayudar a juzgar si su API es suficientemente clara:

source: Note that this means that its contents will be interpolated twice, so
es_es: Tenga en cuenta que esto significa que su contenido será interpolado dos veces.

source: =head2 Remove over-optimisation
es_es: =head2 Eliminar el exceso de optimización

source: perlsec Perl security
es_es: perlsec Seguridad

source: For example, C<~0> usually evaluates to a large integral value.
es_es: Por ejemplo, C<~0> por lo general se evalúa como un valor entero de gran tamaño.

source: $^V will also be a "version object" so the printf("%vd",...) construct will no longer be needed.
es_es: $^V también será un "objeto de versión", por lo que la construcción printf("%vd",...) ya no será necesaria.

source: Dave Mitchell improved the lexer debugging output under C<-DT>
es_es: Dave Mitchell mejoró la salida de depura del analizador léxico con C<-DT>

source: Returns the packed sockaddr address of the other end of the SOCKET connection.
es_es: Devuelve la dirección socket empaquetada del otro extremo de la conexión SOCKET.

source: Operators such as C<**>, C<sin> and C<exp> force arguments to floating point format.
es_es: Algunos operadores, como C<**>, C<sin> y C<exp>, fuerzan la conversión de los argumentos al formato de punto flotante.

source: You may use C<&> after C<< > >>, C<<< >> >>>, C<< < >>, C<< +> >>, C<<< +>> >>>, and C<< +< >>.
es_es: Puede usar C<&> después de C<< > >>, C<<< >> >>>, C<< < >>, C<< +> >>, C<<< +>> >>>, y C<< +< >>.

source: and then there's
es_es: y luego está

source: C<English> upgraded to version 1.02
es_es: C<English> actualizado a la versión 1.02
